module.exports = [
    {
        code: 0,
        name: "مهندسی برق",
        gerayesh: ["قدرت", "مخابرات", "کنترل", "الکترونیک", "مهندسی پزشکی", "مکاترونیک"]
    },
    {
        code: 1,
        name: "مهندسی کامپیوتر",
        gerayesh: ["مهندسی نرم‌افزار", " هوش مصنوعی و رباتیکز", " معماری سیستم های کامپیوتری", "مهندسی الگوریتم ها و محاسبات", "شبکه های کامپیوتری", "رایانش امن (امنیت)"]
    },
    {
        code: 2,
        name: "مهندسی شیمی",
        gerayesh: ["طراحی فرایندها",
            "فرایندهای جداسازی",
            "محیط زیست", "مدل سازی، شبیه سازی و کنترل",
            "فراوری وانتقال گاز", "صنایع غذایی", "بیوتکنولوژی",
            "داروسازی", "ترموسینتیک وکاتالیست", "پلیمر", "نانو فناوری", "فراوری و انتقال گاز", "پدیده های انتقال"]
    },
    {
        code: 3,
        name : "مهندسی عمران",
        gerayesh: ["مهندسی و مدیریت ساخت", "مهندسی سازه", "مهندسی زلزله"
            , "مهندسی ژئوتکنیک", "مهندسی حمل و نقل", "مهندسی راه و ترابری",
            "ساختمان های هوشمند", "مهندسی و مدیریت منابع آب", "سواحل، بنادر، سازه های دریایی"
            , "مهندسی محیط زیست", "مهندسی خطوط راه آهن", "مهندسی حمل و نقل", "مهندسی آب و سازه های هیدرولیکی",
            "پدافند غیر عامل"]
    },
    {
        code: 4,
        name: "مهندسی پلیمر",
        gerayesh: ["فرآورش", "نانو فناوری", "پلیمریزاسیون ", "کامپوزیت (مواد مرکب)", "علوم پایه",]
    },
    {
        code: 5,
        name: "مهندسی صنایع",
        gerayesh: ["بهینه سازی سیستم ها", "سیستم های سلامت", "مدیریت نوآوری و فناوری", "مدل سازی سیستم های کلان", "آینده پژوهی", "سیستم های مالی", "لجستیک و زنجیره تأمین", "مدیریت پروژه", "مدیریت مهندسی",]
    },
    {
        code: 6,
        name: "مهندسی نقشه برداری",
        gerayesh: ["سیستمهای اطلاعات مکانی", "سنجش از دور", "ژئودزی", "فتوگرامتری", "هیدروگرافی"]
    },
    {
        code: 8,
        name: "مهندسی معدن",
        gerayesh: ["فرآوری مواد معدنی", "مکانیک سنگ", "استخراج معدن", " اکتشاف معدن",
            "تونل و فضاهای زیرزمینی", "معدن و محیط زیست", " اقتصاد و مدیریت معدنی",]
    },
    {
        code: 9,
        name: "مهندسی متالوژی",
        gerayesh: ["مهندسی پزشکی بیومتریال", "شناسایی و انتخاب مواد مهندسی", "شکل دادن فلزات", "جوشکاری", "استخراج فلزات", "خوردگی و حفاظت از مواد", "سرامیک", "نانو مواد", "ریخته گری",]
    },
    {
        code: 10,
        name: "مهندسی مکانیک",
        gerayesh: ["ساخت و تولید",
            "طراحی کاربردی",
            "تبدیل انرژی",
            "سیستم محرکه خودرو",
            "طراحی سیستم های دینامیکی خودرو",
            "سازه بدنه خودرو",
            "مکاترونیک",
            "بیومکانیک"]
    },
    {
        code: 11,
        name: "مهندسی نفت",
        gerayesh: [
            "اکتشاف", "حفاری", "بهره برداری", "مخازن هیدروکربوری", "تجهیزات نفتی",
        ]
    },
    {
        code: 900,
        name: "سایر",
        gerayesh: []
    },
];